In [1]:
import pandas as pd
import numpy as np

In [3]:
array1 = np.array((1,2,3,4,5))
array1

array([1, 2, 3, 4, 5])

In [5]:
series1 = pd.Series(('a','b','c','d','e'))
series1

0    a
1    b
2    c
3    d
4    e
dtype: object

In [12]:
series1 = np.array(('a','b','c','d','e'))
series2 = pd.Series(series1 , index = [101,102,103,104,105])
series2

101    a
102    b
103    c
104    d
105    e
dtype: object

In [13]:
type(series2)

pandas.core.series.Series

In [14]:
type(series1)

numpy.ndarray

In [15]:
dict1 = {'a':1,'b':2,'c':3,'d':4}
series3 = pd.Series(dict1)
series3

a    1
b    2
c    3
d    4
dtype: int64

In [24]:
scalar = pd.Series('Batsmen', index = np.arange(0,10,2))
scalar

0    Batsmen
2    Batsmen
4    Batsmen
6    Batsmen
8    Batsmen
dtype: object

In [28]:
scalar1 = pd.Series('Bowler',index = np.arange(1,11,2))
scalar
scalar1

1    Bowler
3    Bowler
5    Bowler
7    Bowler
9    Bowler
dtype: object

In [31]:
scalar1[5] = "Wicket Keeper"

In [32]:
scalar1

1           Bowler
3           Bowler
5    Wicket Keeper
7           Bowler
9           Bowler
dtype: object

In [34]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [42]:
Details = ["Name","DOB","Current Profression","Application"]
Info = ["Nitish Pavan",28061992,"Data Analyst","Python"]
dict1 = {"Details":Details , "Info":Info}
indexes = ['Rank1','Rank2','Rank3','Rank4']
df1 = pd.DataFrame(dict1,index = indexes)
df1

                   Details          Info
Rank1                 Name  Nitish Pavan
Rank2                  DOB      28061992
Rank3  Current Profression  Data Analyst
Rank4          Application        Python

In [44]:
df1['Info']

Rank1    Nitish Pavan
Rank2        28061992
Rank3    Data Analyst
Rank4          Python
Name: Info, dtype: object

In [45]:
df1['Details']

Rank1                   Name
Rank2                    DOB
Rank3    Current Profression
Rank4            Application
Name: Details, dtype: object

In [50]:
Working_Cities = ['Banglore','Hyderabad','Pune','Mumbai']
df1['Working_Cities'] = Working_Cities

In [51]:
df1

                   Details          Info Working_Cities
Rank1                 Name  Nitish Pavan       Banglore
Rank2                  DOB      28061992      Hyderabad
Rank3  Current Profression  Data Analyst           Pune
Rank4          Application        Python         Mumbai

In [52]:
df1

                   Details          Info Working_Cities
Rank1                 Name  Nitish Pavan       Banglore
Rank2                  DOB      28061992      Hyderabad
Rank3  Current Profression  Data Analyst           Pune
Rank4          Application        Python         Mumbai

In [54]:
df1.drop(["Rank1"], axis = 0)
df1

                   Details          Info Working_Cities
Rank1                 Name  Nitish Pavan       Banglore
Rank2                  DOB      28061992      Hyderabad
Rank3  Current Profression  Data Analyst           Pune
Rank4          Application        Python         Mumbai

In [69]:
random = np.random.randint(low = 10, high = 100, size = 8)
Name = np.random.choice(['A','B','C','D','E'], size = 8)
dict1 = {"Range":random, "Name":Name}
dict1

{'Range': array([88, 83, 46, 40, 15, 49, 25, 87]),
 'Name': array(['E', 'C', 'C', 'C', 'A', 'C', 'A', 'A'], dtype='<U1')}

In [72]:
df3 = pd.DataFrame(dict1)

In [73]:
df3

   Range Name
0     88    E
1     83    C
2     46    C
3     40    C
4     15    A
5     49    C
6     25    A
7     87    A

In [74]:
type(df3)

pandas.core.frame.DataFrame

In [75]:
df3.shape

(8, 2)

In [79]:
df3["Range"]

0    88
1    83
2    46
3    40
4    15
5    49
6    25
7    87
Name: Range, dtype: int32

In [80]:
df3.values

array([[88, 'E'],
       [83, 'C'],
       [46, 'C'],
       [40, 'C'],
       [15, 'A'],
       [49, 'C'],
       [25, 'A'],
       [87, 'A']], dtype=object)

In [86]:
df3.tail(8)

   Range Name
0     88    E
1     83    C
2     46    C
3     40    C
4     15    A
5     49    C
6     25    A
7     87    A

In [174]:
marks_df = pd.read_csv("StatewiseTestingDetails.csv",ignoreindex = True)
marks_df

TypeError: parser_f() got an unexpected keyword argument 'ignoreindex'

In [92]:
marks_df["State"]

0       Andaman and Nicobar Islands
1       Andaman and Nicobar Islands
2       Andaman and Nicobar Islands
3       Andaman and Nicobar Islands
4       Andaman and Nicobar Islands
                   ...
6651                    West Bengal
6652                    West Bengal
6653                    West Bengal
6654                    West Bengal
6655                    West Bengal
Name: State, Length: 6656, dtype: object

In [93]:
marks_df.head(10)

        Date                        State  TotalSamples Negative  Positive
0  4/17/2020  Andaman and Nicobar Islands          1403     1210      12.0
1  4/24/2020  Andaman and Nicobar Islands          2679      NaN      27.0
2  4/27/2020  Andaman and Nicobar Islands          2848      NaN      33.0
3   5/1/2020  Andaman and Nicobar Islands          3754      NaN      33.0
4  5/16/2020  Andaman and Nicobar Islands          6677      NaN      33.0
5  5/19/2020  Andaman and Nicobar Islands          6965      NaN      33.0
6  5/20/2020  Andaman and Nicobar Islands          7082      NaN      33.0
7  5/21/2020  Andaman and Nicobar Islands          7167      NaN      33.0
8  5/22/2020  Andaman and Nicobar Islands          7263      NaN      33.0
9  5/23/2020  Andaman and Nicobar Islands          7327      NaN      33.0

In [126]:
Name = ["Nitish","Maruthi","Sharath","Harsha","Bubby"]
Physics = np.random.randint(low = 70, high = 100, size = 5)
Biology = np.random.randint(low = 70, high = 100, size = 5)
Mathematics = np.random.randint(low = 70, high = 100, size = 5)
English = np.random.randint(low = 70, high = 100, size = 5)
Telugu = np.random.randint(low = 70, high = 100, size = 5)


dict1 = {"Name":Name , "Physics":Physics, "Biology":Biology, "Mathematics":Mathematics,"English":English,"Telugu":Telugu,"Total":Physics+Biology+Mathematics+English+Telugu}
df4 = pd.DataFrame(dict1)
df4

      Name  Physics  Biology  Mathematics  English  Telugu  Total
0   Nitish       74       80           75       73      98    400
1  Maruthi       81       80           73       75      98    407
2  Sharath       80       97           99       75      75    426
3   Harsha       98       92           81       92      85    448
4    Bubby       79       91           74       80      97    421

In [127]:
df.to_csv("Marks_Sheet.csv")

In [143]:
df4

         Physics  Biology  Mathematics  English  Telugu  Total
Name
Nitish        74       80           75       73      98    400
Maruthi       81       80           73       75      98    407
Sharath       80       97           99       75      75    426
Harsha        98       92           81       92      85    448
Bubby         79       91           74       80      97    421

In [144]:
df4.iloc[0]

Physics         74
Biology         80
Mathematics     75
English         73
Telugu          98
Total          400
Name: Nitish, dtype: int32

In [145]:
df4.iloc[1]

Physics         81
Biology         80
Mathematics     73
English         75
Telugu          98
Total          407
Name: Maruthi, dtype: int32

In [147]:
df4.iloc[0]

Physics         74
Biology         80
Mathematics     75
English         73
Telugu          98
Total          400
Name: Nitish, dtype: int32

In [148]:
df4

         Physics  Biology  Mathematics  English  Telugu  Total
Name
Nitish        74       80           75       73      98    400
Maruthi       81       80           73       75      98    407
Sharath       80       97           99       75      75    426
Harsha        98       92           81       92      85    448
Bubby         79       91           74       80      97    421

In [151]:
df4.loc[["Sharath","Maruthi"]]

         Physics  Biology  Mathematics  English  Telugu  Total
Name
Sharath       80       97           99       75      75    426
Maruthi       81       80           73       75      98    407

In [152]:
df4.iloc[0]

Physics         74
Biology         80
Mathematics     75
English         73
Telugu          98
Total          400
Name: Nitish, dtype: int32

In [153]:
df4.loc[["Bubby","Harsha"]]

        Physics  Biology  Mathematics  English  Telugu  Total
Name
Bubby        79       91           74       80      97    421
Harsha       98       92           81       92      85    448

In [156]:
p1 = ['a','b']
p2 = [0,1]
d1 = {"p1":p1, "p2":p2}
df_d1 = pd.DataFrame(d1)
df_d1

  p1  p2
0  a   0
1  b   1

In [163]:
p1 = ['b','c']
p2 = [2,3]
p3 = ['ab','bc']
d2 = {"p1":p1, "p2":p2, "p3":p3}
df_d2 = pd.DataFrame(d2)
df_d2

  p1  p2  p3
0  b   2  ab
1  c   3  bc

In [165]:
pd.concat([df_d1,df_d2],axis = 0)

  p1  p2   p3
0  a   0  NaN
1  b   1  NaN
0  b   2   ab
1  c   3   bc

In [169]:
pd.concat([df_d1,df_d2],axis = 0, ignore_index = True)

  p1  p2   p3
0  a   0  NaN
1  b   1  NaN
2  b   2   ab
3  c   3   bc

In [170]:
marks_df

            Date                        State  TotalSamples Negative  Positive
0      4/17/2020  Andaman and Nicobar Islands          1403     1210      12.0
1      4/24/2020  Andaman and Nicobar Islands          2679      NaN      27.0
2      4/27/2020  Andaman and Nicobar Islands          2848      NaN      33.0
3       5/1/2020  Andaman and Nicobar Islands          3754      NaN      33.0
4      5/16/2020  Andaman and Nicobar Islands          6677      NaN      33.0
...          ...                          ...           ...      ...       ...
6651  10/22/2020                  West Bengal       4166495      NaN       NaN
6652  10/23/2020                  West Bengal       4211077      NaN       NaN
6653  10/24/2020                  West Bengal       4255801      NaN       NaN
6654  10/25/2020                  West Bengal       4298339      NaN       NaN
6655  10/26/2020                  West Bengal       4340570      NaN       NaN

[6656 rows x 5 columns]

In [171]:
marks_df["State"]

0       Andaman and Nicobar Islands
1       Andaman and Nicobar Islands
2       Andaman and Nicobar Islands
3       Andaman and Nicobar Islands
4       Andaman and Nicobar Islands
                   ...
6651                    West Bengal
6652                    West Bengal
6653                    West Bengal
6654                    West Bengal
6655                    West Bengal
Name: State, Length: 6656, dtype: object

In [173]:
State = marks_df["State"]
Count = marks_df["Positive"]
State
Count

0       12.0
1       27.0
2       33.0
3       33.0
4       33.0
        ...
6651     NaN
6652     NaN
6653     NaN
6654     NaN
6655     NaN
Name: Positive, Length: 6656, dtype: float64